import csv

with open('filenames.csv', newline='') as f:
    reader = csv.reader(f)
    data = list(reader)

filenames = data[0]

regions = ('Вінницька', 'Волинська', 'Дніпропетровська', 'Житомирська', 'Закарпатська', 'Запорізька',
           'Івано-Франківська', 'Київська', 'Кіровоградська', 'Львівська', 'Миколаївська', 'Одеська', 'Полтавська',
           'Рівненська', 'Сумська', 'Тернопільська', 'Харківська', 'Херсонська', 'Хмельницька', 'Черкаська',
           'Чернівецька', 'Чернігівська', 'Київ')

