import csv

filenames = list()


def rescan_filenames():
    global data
    with open('filenames.csv', newline='') as f:
        reader = csv.reader(f)
        data = list(reader)
    f.close()
    global filenames
    filenames = data[0]


rescan_filenames()

regions = ('Вінницька', 'Волинська', 'Дніпропетровська', 'Житомирська', 'Закарпатська', 'Запорізька',
           'Івано-Франківська', 'Київська', 'Кіровоградська', 'Львівська', 'Миколаївська', 'Одеська', 'Полтавська',
           'Рівненська', 'Сумська', 'Тернопільська', 'Харківська', 'Херсонська', 'Хмельницька', 'Черкаська',
           'Чернівецька', 'Чернігівська', 'Київ')

ip_port_regex = '''^(([0-9]|[1-9][0-9]|1[0-9]{2}|2[0-4][0-9]|25[0-5])\.){3}([0-9]|[1-9][0-9]|1[0-9]{2}|2[0-4][0-9]|25[0-5]):[0-9]{1,5}$'''
